Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMHA0_DFP/2.1.52/samha0ab/atdf/ATSAMHA0G17AB.atdf
            <register name="CHSTATUS"
                      offset="0xC"
                      rw="R"
                      size="4"
                      initval="0x000F00FF"
                      caption="Channel Status">
               <bitfield name="USRRDY0" caption="Channel 0 User Ready" mask="0x1"/>
               <bitfield name="USRRDY1" caption="Channel 1 User Ready" mask="0x2"/>
               <bitfield name="USRRDY2" caption="Channel 2 User Ready" mask="0x4"/>
               <bitfield name="USRRDY3" caption="Channel 3 User Ready" mask="0x8"/>
               <bitfield name="USRRDY4" caption="Channel 4 User Ready" mask="0x10"/>
               <bitfield name="USRRDY5" caption="Channel 5 User Ready" mask="0x20"/>
               <bitfield name="USRRDY6" caption="Channel 6 User Ready" mask="0x40"/>
               <bitfield name="USRRDY7" caption="Channel 7 User Ready" mask="0x80"/>
               <bitfield name="CHBUSY0" caption="Channel 0 Busy" mask="0x100"/>
               <bitfield name="CHBUSY1" caption="Channel 1 Busy" mask="0x200"/>
               <bitfield name="CHBUSY2" caption="Channel 2 Busy" mask="0x400"/>
               <bitfield name="CHBUSY3" caption="Channel 3 Busy" mask="0x800"/>
               <bitfield name="CHBUSY4" caption="Channel 4 Busy" mask="0x1000"/>
               <bitfield name="CHBUSY5" caption="Channel 5 Busy" mask="0x2000"/>
               <bitfield name="CHBUSY6" caption="Channel 6 Busy" mask="0x4000"/>
               <bitfield name="CHBUSY7" caption="Channel 7 Busy" mask="0x8000"/>
               <bitfield name="USRRDY8" caption="Channel 8 User Ready" mask="0x10000"/>
               <bitfield name="USRRDY9" caption="Channel 9 User Ready" mask="0x20000"/>
               <bitfield name="USRRDY10" caption="Channel 10 User Ready" mask="0x40000"/>
               <bitfield name="USRRDY11" caption="Channel 11 User Ready" mask="0x80000"/>
               <bitfield name="CHBUSY8" caption="Channel 8 Busy" mask="0x1000000"/>
               <bitfield name="CHBUSY9" caption="Channel 9 Busy" mask="0x2000000"/>
               <bitfield name="CHBUSY10" caption="Channel 10 Busy" mask="0x4000000"/>
               <bitfield name="CHBUSY11" caption="Channel 11 Busy" mask="0x8000000"/>
            </register>
            <register name="INTENCLR"
                      offset="0x10"
                      rw="RW"
                      size="4"
                      atomic-op="clear:INTENCLR"
                      initval="0x00000000"
                      caption="Interrupt Enable Clear">
               <bitfield name="OVR0" caption="Channel 0 Overrun Interrupt Enable" mask="0x1"/>
               <bitfield name="OVR1" caption="Channel 1 Overrun Interrupt Enable" mask="0x2"/>
               <bitfield name="OVR2" caption="Channel 2 Overrun Interrupt Enable" mask="0x4"/>
               <bitfield name="OVR3" caption="Channel 3 Overrun Interrupt Enable" mask="0x8"/>
               <bitfield name="OVR4"
                         caption="Channel 4 Overrun Interrupt Enable"
                         mask="0x10"/>
               <bitfield name="OVR5"
                         caption="Channel 5 Overrun Interrupt Enable"
                         mask="0x20"/>
               <bitfield name="OVR6"
                         caption="Channel 6 Overrun Interrupt Enable"
                         mask="0x40"/>
               <bitfield name="OVR7"
                         caption="Channel 7 Overrun Interrupt Enable"
                         mask="0x80"/>
               <bitfield name="EVD0"
                         caption="Channel 0 Event Detection Interrupt Enable"
                         mask="0x100"/>
               <bitfield name="EVD1"
                         caption="Channel 1 Event Detection Interrupt Enable"
                         mask="0x200"/>
               <bitfield name="EVD2"
                         caption="Channel 2 Event Detection Interrupt Enable"
                         mask="0x400"/>
               <bitfield name="EVD3"
                         caption="Channel 3 Event Detection Interrupt Enable"
                         mask="0x800"/>
               <bitfield name="EVD4"
                         caption="Channel 4 Event Detection Interrupt Enable"
                         mask="0x1000"/>
               <bitfield name="EVD5"
                         caption="Channel 5 Event Detection Interrupt Enable"
                         mask="0x2000"/>
               <bitfield name="EVD6"
                         caption="Channel 6 Event Detection Interrupt Enable"
                         mask="0x4000"/>
               <bitfield name="EVD7"
                         caption="Channel 7 Event Detection Interrupt Enable"
                         mask="0x8000"/>
               <bitfield name="OVR8"
                         caption="Channel 8 Overrun Interrupt Enable"
                         mask="0x10000"/>
               <bitfield name="OVR9"
                         caption="Channel 9 Overrun Interrupt Enable"
                         mask="0x20000"/>
               <bitfield name="OVR10"
                         caption="Channel 10 Overrun Interrupt Enable"
                         mask="0x40000"/>
               <bitfield name="OVR11"
                         caption="Channel 11 Overrun Interrupt Enable"
                         mask="0x80000"/>
               <bitfield name="EVD8"
                         caption="Channel 8 Event Detection Interrupt Enable"
                         mask="0x1000000"/>
               <bitfield name="EVD9"
                         caption="Channel 9 Event Detection Interrupt Enable"
                         mask="0x2000000"/>
               <bitfield name="EVD10"
                         caption="Channel 10 Event Detection Interrupt Enable"
                         mask="0x4000000"/>
               <bitfield name="EVD11"
                         caption="Channel 11 Event Detection Interrupt Enable"
                         mask="0x8000000"/>
            </register>
            <register name="INTENSET"
                      offset="0x14"
                      rw="RW"
                      size="4"
                      atomic-op="set:INTENSET"
                      initval="0x00000000"
                      caption="Interrupt Enable Set">
               <bitfield name="OVR0" caption="Channel 0 Overrun Interrupt Enable" mask="0x1"/>
               <bitfield name="OVR1" caption="Channel 1 Overrun Interrupt Enable" mask="0x2"/>
               <bitfield name="OVR2" caption="Channel 2 Overrun Interrupt Enable" mask="0x4"/>
               <bitfield name="OVR3" caption="Channel 3 Overrun Interrupt Enable" mask="0x8"/>
               <bitfield name="OVR4"
                         caption="Channel 4 Overrun Interrupt Enable"
                         mask="0x10"/>
               <bitfield name="OVR5"
                         caption="Channel 5 Overrun Interrupt Enable"
                         mask="0x20"/>
               <bitfield name="OVR6"
                         caption="Channel 6 Overrun Interrupt Enable"
                         mask="0x40"/>
               <bitfield name="OVR7"
                         caption="Channel 7 Overrun Interrupt Enable"
                         mask="0x80"/>
               <bitfield name="EVD0"
                         caption="Channel 0 Event Detection Interrupt Enable"
                         mask="0x100"/>
               <bitfield name="EVD1"
                         caption="Channel 1 Event Detection Interrupt Enable"
                         mask="0x200"/>
               <bitfield name="EVD2"
                         caption="Channel 2 Event Detection Interrupt Enable"
                         mask="0x400"/>
               <bitfield name="EVD3"
                         caption="Channel 3 Event Detection Interrupt Enable"
                         mask="0x800"/>
               <bitfield name="EVD4"
                         caption="Channel 4 Event Detection Interrupt Enable"
                         mask="0x1000"/>
               <bitfield name="EVD5"
                         caption="Channel 5 Event Detection Interrupt Enable"
                         mask="0x2000"/>
               <bitfield name="EVD6"
                         caption="Channel 6 Event Detection Interrupt Enable"
                         mask="0x4000"/>
               <bitfield name="EVD7"
                         caption="Channel 7 Event Detection Interrupt Enable"
                         mask="0x8000"/>
               <bitfield name="OVR8"
                         caption="Channel 8 Overrun Interrupt Enable"
                         mask="0x10000"/>
               <bitfield name="OVR9"
                         caption="Channel 9 Overrun Interrupt Enable"
                         mask="0x20000"/>
               <bitfield name="OVR10"
                         caption="Channel 10 Overrun Interrupt Enable"
                         mask="0x40000"/>
               <bitfield name="OVR11"
                         caption="Channel 11 Overrun Interrupt Enable"
                         mask="0x80000"/>
               <bitfield name="EVD8"
                         caption="Channel 8 Event Detection Interrupt Enable"
                         mask="0x1000000"/>
               <bitfield name="EVD9"
                         caption="Channel 9 Event Detection Interrupt Enable"
                         mask="0x2000000"/>
               <bitfield name="EVD10"
                         caption="Channel 10 Event Detection Interrupt Enable"
                         mask="0x4000000"/>
               <bitfield name="EVD11"
                         caption="Channel 11 Event Detection Interrupt Enable"
                         mask="0x8000000"/>
            </register>
            <register name="INTFLAG"
                      offset="0x18"
                      rw="RW"
                      size="4"
                      atomic-op="clear:INTFLAG"
                      initval="0x00000000"
                      caption="Interrupt Flag Status and Clear">
               <bitfield name="OVR0" caption="Channel 0 Overrun" mask="0x1"/>
               <bitfield name="OVR1" caption="Channel 1 Overrun" mask="0x2"/>
               <bitfield name="OVR2" caption="Channel 2 Overrun" mask="0x4"/>
               <bitfield name="OVR3" caption="Channel 3 Overrun" mask="0x8"/>
               <bitfield name="OVR4" caption="Channel 4 Overrun" mask="0x10"/>
               <bitfield name="OVR5" caption="Channel 5 Overrun" mask="0x20"/>
               <bitfield name="OVR6" caption="Channel 6 Overrun" mask="0x40"/>
               <bitfield name="OVR7" caption="Channel 7 Overrun" mask="0x80"/>
               <bitfield name="EVD0" caption="Channel 0 Event Detection" mask="0x100"/>
               <bitfield name="EVD1" caption="Channel 1 Event Detection" mask="0x200"/>
               <bitfield name="EVD2" caption="Channel 2 Event Detection" mask="0x400"/>
               <bitfield name="EVD3" caption="Channel 3 Event Detection" mask="0x800"/>
               <bitfield name="EVD4" caption="Channel 4 Event Detection" mask="0x1000"/>
               <bitfield name="EVD5" caption="Channel 5 Event Detection" mask="0x2000"/>
               <bitfield name="EVD6" caption="Channel 6 Event Detection" mask="0x4000"/>
               <bitfield name="EVD7" caption="Channel 7 Event Detection" mask="0x8000"/>
               <bitfield name="OVR8" caption="Channel 8 Overrun" mask="0x10000"/>
               <bitfield name="OVR9" caption="Channel 9 Overrun" mask="0x20000"/>
               <bitfield name="OVR10" caption="Channel 10 Overrun" mask="0x40000"/>
               <bitfield name="OVR11" caption="Channel 11 Overrun" mask="0x80000"/>
               <bitfield name="EVD8" caption="Channel 8 Event Detection" mask="0x1000000"/>
               <bitfield name="EVD9" caption="Channel 9 Event Detection" mask="0x2000000"/>
               <bitfield name="EVD10" caption="Channel 10 Event Detection" mask="0x4000000"/>
               <bitfield name="EVD11" caption="Channel 11 Event Detection" mask="0x8000000"/>
            </register>
         </register-group>
         <value-group name="EVSYS_CHANNEL__EDGSEL">
            <value name="NO_EVT_OUTPUT"
                   caption="No event output when using the resynchronized or synchronous path"
                   value="0"/>
            <value name="RISING_EDGE"
                   caption="Event detection only on the rising edge of the signal from the event generator when using the resynchronized or synchronous path"
                   value="1"/>
            <value name="FALLING_EDGE"
                   caption="Event detection only on the falling edge of the signal from the event generator when using the resynchronized or synchronous path"
                   value="2"/>
            <value name="BOTH_EDGES"
                   caption="Event detection on rising and falling edges of the signal from the event generator when using the resynchronized or synchronous path"
                   value="3"/>
         </value-group>
         <value-group name="EVSYS_CHANNEL__PATH">
            <value name="SYNCHRONOUS" caption="Synchronous path" value="0"/>
            <value name="RESYNCHRONIZED" caption="Resynchronized path" value="1"/>
            <value name="ASYNCHRONOUS" caption="Asynchronous path" value="2"/>
         </value-group>
         <value-group name="EVSYS_USER__CHANNEL">
            <value name="0" caption="No Channel Output Selected" value="0"/>
         </value-group>
      </module>
      <module name="GCLK"
              id="U2102"
              version="2.1.0"
              caption="Generic Clock Generator">
         <register-group name="GCLK" caption="Generic Clock Generator">
            <register name="CTRL"
                      offset="0x0"
                      rw="RW"
                      access="WSYNC"
                      size="1"
                      initval="0x00"
                      caption="Control">
               <bitfield name="SWRST" caption="Software Reset" mask="0x1"/>
            </register>
            <register name="STATUS"
                      offset="0x1"
                      rw="R"
                      size="1"
                      initval="0x00"
                      caption="Status">
               <bitfield name="SYNCBUSY" caption="Synchronization Busy Status" mask="0x80"/>
            </register>
