Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMHA0_DFP/2.1.52/samha0ab/atdf/ATSAMHA0G17AB.atdf
      <module name="HMATRIXB" id="I7638" version="2.1.2" caption="HSB Matrix">
         <register-group name="PRS" size="0x8">
            <register name="PRAS"
                      offset="0x0"
                      rw="RW"
                      size="4"
                      access-size="4"
                      initval="0x00000000"
                      caption="Priority A for Slave">
        </register>
            <register name="PRBS"
                      offset="0x4"
                      rw="RW"
                      size="4"
                      access-size="4"
                      initval="0x00000000"
                      caption="Priority B for Slave">
        </register>
         </register-group>
         <register-group name="HMATRIXB" caption="HSB Matrix">
            <register-group name="PRS"
                            name-in-module="PRS"
                            offset="0x080"
                            size="0x8"
                            count="16"/>
            <register name="SFR"
                      offset="0x110"
                      rw="RW"
                      size="4"
                      access-size="4"
                      count="16"
                      initval="0x00000000"
                      caption="Special Function">
               <bitfield name="SFR" caption="Special Function Register" mask="0xFFFFFFFF"/>
            </register>
         </register-group>
      </module>
      <module name="MTB"
              id="U2002"
              version="1.0.0"
              caption="Cortex-M0+ Micro-Trace Buffer">
         <register-group name="MTB" caption="Cortex-M0+ Micro-Trace Buffer">
            <register name="POSITION"
                      offset="0x0"
                      rw="RW"
                      size="4"
                      access-size="4"
                      caption="MTB Position">
               <bitfield name="WRAP" caption="Pointer Value Wraps" mask="0x4"/>
               <bitfield name="POINTER"
                         caption="Trace Packet Location Pointer"
                         mask="0xFFFFFFF8"/>
            </register>
            <register name="MASTER"
                      offset="0x4"
                      rw="RW"
                      size="4"
                      access-size="4"
                      initval="0x00000000"
                      caption="MTB Master">
               <bitfield name="MASK"
                         caption="Maximum Value of the Trace Buffer in SRAM"
                         mask="0x1F"/>
               <bitfield name="TSTARTEN" caption="Trace Start Input Enable" mask="0x20"/>
               <bitfield name="TSTOPEN" caption="Trace Stop Input Enable" mask="0x40"/>
               <bitfield name="SFRWPRIV"
                         caption="Special Function Register Write Privilege"
                         mask="0x80"/>
               <bitfield name="RAMPRIV" caption="SRAM Privilege" mask="0x100"/>
               <bitfield name="HALTREQ" caption="Halt Request" mask="0x200"/>
               <bitfield name="EN" caption="Main Trace Enable" mask="0x80000000"/>
            </register>
            <register name="FLOW"
                      offset="0x8"
                      rw="RW"
                      size="4"
                      access-size="4"
                      initval="0x00000000"
                      caption="MTB Flow">
               <bitfield name="AUTOSTOP" caption="Auto Stop Tracing" mask="0x1"/>
               <bitfield name="AUTOHALT" caption="Auto Halt Request" mask="0x2"/>
               <bitfield name="WATERMARK" caption="Watermark value" mask="0xFFFFFFF8"/>
            </register>
            <register name="BASE"
                      offset="0xC"
                      rw="R"
                      size="4"
                      access-size="4"
                      caption="MTB Base">
        </register>
            <register name="ITCTRL"
                      offset="0xF00"
                      rw="RW"
                      size="4"
                      access-size="4"
                      caption="MTB Integration Mode Control">
        </register>
            <register name="CLAIMSET"
                      offset="0xFA0"
                      rw="RW"
                      size="4"
                      access-size="4"
                      atomic-op="set:CLAIMSET"
                      caption="MTB Claim Set">
        </register>
            <register name="CLAIMCLR"
                      offset="0xFA4"
                      rw="RW"
                      size="4"
                      access-size="4"
                      atomic-op="clear:CLAIMCLR"
                      caption="MTB Claim Clear">
        </register>
            <register name="LOCKACCESS"
                      offset="0xFB0"
                      rw="RW"
                      size="4"
                      access-size="4"
                      caption="MTB Lock Access">
        </register>
            <register name="LOCKSTATUS"
                      offset="0xFB4"
                      rw="R"
                      size="4"
                      access-size="4"
                      caption="MTB Lock Status">
        </register>
            <register name="AUTHSTATUS"
                      offset="0xFB8"
                      rw="R"
                      size="4"
                      access-size="4"
                      caption="MTB Authentication Status">
        </register>
            <register name="DEVARCH"
                      offset="0xFBC"
                      rw="R"
                      size="4"
                      access-size="4"
                      caption="MTB Device Architecture">
        </register>
            <register name="DEVID"
                      offset="0xFC8"
                      rw="R"
                      size="4"
                      access-size="4"
                      caption="MTB Device Configuration">
        </register>
            <register name="DEVTYPE"
                      offset="0xFCC"
                      rw="R"
                      size="4"
                      access-size="4"
                      caption="MTB Device Type">
        </register>
