Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMHA0_DFP/2.1.52/samha0ab/atdf/ATSAMHA0G17AB.atdf
            <register modes="MODE2"
                      name="ALARM"
                      offset="0x18"
                      rw="RW"
                      access="WSYNC"
                      size="4"
                      initval="0x00000000"
                      caption="MODE2_ALARM Alarm n Value">
               <bitfield name="SECOND" caption="Second" mask="0x3F"/>
               <bitfield name="MINUTE" caption="Minute" mask="0xFC0"/>
               <bitfield name="HOUR"
                         caption="Hour"
                         mask="0x1F000"
                         values="RTC_MODE2_ALARM_ALARM__HOUR"/>
               <bitfield name="DAY" caption="Day" mask="0x3E0000"/>
               <bitfield name="MONTH" caption="Month" mask="0x3C00000"/>
               <bitfield name="YEAR" caption="Year" mask="0xFC000000"/>
            </register>
            <register modes="MODE2"
                      name="MASK"
                      offset="0x1C"
                      rw="RW"
                      access="WSYNC"
                      size="1"
                      initval="0x00"
                      caption="MODE2_ALARM Alarm n Mask">
               <bitfield name="SEL"
                         caption="Alarm Mask Selection"
                         mask="0x7"
                         values="RTC_MODE2_ALARM_MASK__SEL"/>
            </register>
         </register-group>
         <value-group name="RTC_MODE0_CTRL__MODE">
            <value name="COUNT32" caption="Mode 0: 32-bit Counter" value="0x0"/>
            <value name="COUNT16" caption="Mode 1: 16-bit Counter" value="0x1"/>
            <value name="CLOCK" caption="Mode 2: Clock/Calendar" value="0x2"/>
         </value-group>
         <value-group name="RTC_MODE0_CTRL__PRESCALER">
            <value name="DIV1" caption="CLK_RTC_CNT = GCLK_RTC/1" value="0x0"/>
            <value name="DIV2" caption="CLK_RTC_CNT = GCLK_RTC/2" value="0x1"/>
            <value name="DIV4" caption="CLK_RTC_CNT = GCLK_RTC/4" value="0x2"/>
            <value name="DIV8" caption="CLK_RTC_CNT = GCLK_RTC/8" value="0x3"/>
            <value name="DIV16" caption="CLK_RTC_CNT = GCLK_RTC/16" value="0x4"/>
            <value name="DIV32" caption="CLK_RTC_CNT = GCLK_RTC/32" value="0x5"/>
            <value name="DIV64" caption="CLK_RTC_CNT = GCLK_RTC/64" value="0x6"/>
            <value name="DIV128" caption="CLK_RTC_CNT = GCLK_RTC/128" value="0x7"/>
            <value name="DIV256" caption="CLK_RTC_CNT = GCLK_RTC/256" value="0x8"/>
            <value name="DIV512" caption="CLK_RTC_CNT = GCLK_RTC/512" value="0x9"/>
            <value name="DIV1024" caption="CLK_RTC_CNT = GCLK_RTC/1024" value="0xA"/>
         </value-group>
         <value-group name="RTC_MODE1_CTRL__MODE">
            <value name="COUNT32" caption="Mode 0: 32-bit Counter" value="0x0"/>
            <value name="COUNT16" caption="Mode 1: 16-bit Counter" value="0x1"/>
            <value name="CLOCK" caption="Mode 2: Clock/Calendar" value="0x2"/>
         </value-group>
         <value-group name="RTC_MODE1_CTRL__PRESCALER">
            <value name="DIV1" caption="CLK_RTC_CNT = GCLK_RTC/1" value="0x0"/>
            <value name="DIV2" caption="CLK_RTC_CNT = GCLK_RTC/2" value="0x1"/>
            <value name="DIV4" caption="CLK_RTC_CNT = GCLK_RTC/4" value="0x2"/>
            <value name="DIV8" caption="CLK_RTC_CNT = GCLK_RTC/8" value="0x3"/>
            <value name="DIV16" caption="CLK_RTC_CNT = GCLK_RTC/16" value="0x4"/>
            <value name="DIV32" caption="CLK_RTC_CNT = GCLK_RTC/32" value="0x5"/>
            <value name="DIV64" caption="CLK_RTC_CNT = GCLK_RTC/64" value="0x6"/>
            <value name="DIV128" caption="CLK_RTC_CNT = GCLK_RTC/128" value="0x7"/>
            <value name="DIV256" caption="CLK_RTC_CNT = GCLK_RTC/256" value="0x8"/>
            <value name="DIV512" caption="CLK_RTC_CNT = GCLK_RTC/512" value="0x9"/>
            <value name="DIV1024" caption="CLK_RTC_CNT = GCLK_RTC/1024" value="0xA"/>
         </value-group>
         <value-group name="RTC_MODE2_CTRL__MODE">
            <value name="COUNT32" caption="Mode 0: 32-bit Counter" value="0x0"/>
            <value name="COUNT16" caption="Mode 1: 16-bit Counter" value="0x1"/>
            <value name="CLOCK" caption="Mode 2: Clock/Calendar" value="0x2"/>
         </value-group>
         <value-group name="RTC_MODE2_CTRL__PRESCALER">
            <value name="DIV1" caption="CLK_RTC_CNT = GCLK_RTC/1" value="0x0"/>
            <value name="DIV2" caption="CLK_RTC_CNT = GCLK_RTC/2" value="0x1"/>
            <value name="DIV4" caption="CLK_RTC_CNT = GCLK_RTC/4" value="0x2"/>
            <value name="DIV8" caption="CLK_RTC_CNT = GCLK_RTC/8" value="0x3"/>
            <value name="DIV16" caption="CLK_RTC_CNT = GCLK_RTC/16" value="0x4"/>
            <value name="DIV32" caption="CLK_RTC_CNT = GCLK_RTC/32" value="0x5"/>
            <value name="DIV64" caption="CLK_RTC_CNT = GCLK_RTC/64" value="0x6"/>
            <value name="DIV128" caption="CLK_RTC_CNT = GCLK_RTC/128" value="0x7"/>
            <value name="DIV256" caption="CLK_RTC_CNT = GCLK_RTC/256" value="0x8"/>
            <value name="DIV512" caption="CLK_RTC_CNT = GCLK_RTC/512" value="0x9"/>
            <value name="DIV1024" caption="CLK_RTC_CNT = GCLK_RTC/1024" value="0xA"/>
         </value-group>
         <value-group name="RTC_MODE2_CLOCK__HOUR">
            <value name="AM" caption="AM when CLKREP in 12-hour" value="0x00"/>
            <value name="PM" caption="PM when CLKREP in 12-hour" value="0x10"/>
         </value-group>
         <value-group name="RTC_MODE2_ALARM_ALARM__HOUR">
            <value name="AM" caption="Morning hour" value="0x00"/>
            <value name="PM" caption="Afternoon hour" value="0x10"/>
         </value-group>
         <value-group name="RTC_MODE2_ALARM_MASK__SEL">
            <value name="OFF" caption="Alarm Disabled" value="0x0"/>
            <value name="SS" caption="Match seconds only" value="0x1"/>
            <value name="MMSS" caption="Match seconds and minutes only" value="0x2"/>
            <value name="HHMMSS"
                   caption="Match seconds, minutes, and hours only"
                   value="0x3"/>
            <value name="DDHHMMSS"
                   caption="Match seconds, minutes, hours, and days only"
                   value="0x4"/>
            <value name="MMDDHHMMSS"
                   caption="Match seconds, minutes, hours, days, and months only"
                   value="0x5"/>
            <value name="YYMMDDHHMMSS"
                   caption="Match seconds, minutes, hours, days, months, and years"
                   value="0x6"/>
         </value-group>
      </module>
      <module name="SERCOM"
              id="U2201"
              version="2.2.0"
              caption="Serial Communication Interface">
         <register-group name="SERCOM" caption="Serial Communication Interface">
            <mode name="I2CM"
                  qualifier="SERCOM.I2CM_CTRLA.MODE"
                  value="5"
                  caption="I2C Master Mode"/>
            <mode name="I2CS"
                  qualifier="SERCOM.I2CS_CTRLA.MODE"
                  value="4"
                  caption="I2C Slave Mode"/>
            <mode name="SPIS"
                  qualifier="SERCOM.SPIS_CTRLA.MODE"
                  mask="6"
                  value="2"
                  caption="SPI Slave Mode"/>
            <mode name="SPIM"
                  qualifier="SERCOM.SPIM_CTRLA.MODE"
                  mask="6"
                  value="3"
                  caption="SPI Master Mode"/>
            <mode name="USART_EXT"
                  qualifier="SERCOM.USART_CTRLA.MODE"
                  mask="6"
                  value="0"
                  caption="USART EXTERNAL CLOCK Mode"/>
            <mode name="USART_INT"
                  qualifier="SERCOM.USART_CTRLA.MODE"
                  mask="6"
                  value="1"
                  caption="USART INTERNAL CLOCK Mode"/>
            <register modes="I2CM"
                      name="CTRLA"
                      offset="0x0"
                      rw="RW"
                      size="4"
                      initval="0x00000000"
                      caption="I2CM Control A">
               <bitfield name="SWRST" caption="Software Reset" mask="0x1"/>
               <bitfield name="ENABLE" caption="Enable" mask="0x2"/>
               <bitfield name="MODE"
                         caption="Operating Mode"
                         mask="0x1C"
                         values="SERCOM_I2CM_CTRLA__MODE"/>
               <bitfield name="RUNSTDBY" caption="Run in Standby" mask="0x80"/>
               <bitfield name="PINOUT" caption="Pin Usage" mask="0x10000"/>
               <bitfield name="SDAHOLD"
                         caption="SDA Hold Time"
                         mask="0x300000"
                         values="SERCOM_I2CM_CTRLA__SDAHOLD"/>
               <bitfield name="MEXTTOEN"
                         caption="Master SCL Low Extend Timeout"
                         mask="0x400000"/>
               <bitfield name="SEXTTOEN"
                         caption="Slave SCL Low Extend Timeout"
                         mask="0x800000"/>
               <bitfield name="SPEED"
                         caption="Transfer Speed"
                         mask="0x3000000"
                         values="SERCOM_I2CM_CTRLA__SPEED"/>
               <bitfield name="SCLSM" caption="SCL Clock Stretch Mode" mask="0x8000000"/>
               <bitfield name="INACTOUT"
                         caption="Inactive Time-Out"
                         mask="0x30000000"
                         values="SERCOM_I2CM_CTRLA__INACTOUT"/>
               <bitfield name="LOWTOUTEN" caption="SCL Low Timeout Enable" mask="0x40000000"/>
            </register>
            <register modes="I2CS"
                      name="CTRLA"
                      offset="0x0"
                      rw="RW"
                      size="4"
                      initval="0x00000000"
                      caption="I2CS Control A">
               <bitfield name="SWRST" caption="Software Reset" mask="0x1"/>
               <bitfield name="ENABLE" caption="Enable" mask="0x2"/>
               <bitfield name="MODE"
                         caption="Operating Mode"
                         mask="0x1C"
                         values="SERCOM_I2CM_CTRLA__MODE"/>
               <bitfield name="RUNSTDBY" caption="Run during Standby" mask="0x80"/>
               <bitfield name="PINOUT" caption="Pin Usage" mask="0x10000"/>
               <bitfield name="SDAHOLD"
                         caption="SDA Hold Time"
                         mask="0x300000"
                         values="SERCOM_I2CM_CTRLA__SDAHOLD"/>
               <bitfield name="SEXTTOEN"
                         caption="Slave SCL Low Extend Timeout"
                         mask="0x800000"/>
               <bitfield name="SPEED"
                         caption="Transfer Speed"
                         mask="0x3000000"
                         values="SERCOM_I2CM_CTRLA__SPEED"/>
               <bitfield name="SCLSM" caption="SCL Clock Stretch Mode" mask="0x8000000"/>
               <bitfield name="LOWTOUTEN" caption="SCL Low Timeout Enable" mask="0x40000000"/>
            </register>
            <register modes="SPIM"
                      name="CTRLA"
                      offset="0x0"
                      rw="RW"
                      size="4"
                      initval="0x00000000"
                      caption="SPIM Control A">
               <bitfield name="SWRST" caption="Software Reset" mask="0x1"/>
               <bitfield name="ENABLE" caption="Enable" mask="0x2"/>
               <bitfield name="MODE"
                         caption="Operating Mode"
                         mask="0x1C"
                         values="SERCOM_SPIM_CTRLA__MODE"/>
               <bitfield name="RUNSTDBY" caption="Run during Standby" mask="0x80"/>
               <bitfield name="IBON"
                         caption="Immediate Buffer Overflow Notification"
                         mask="0x100"/>
               <bitfield name="DOPO"
                         caption="Data Out Pinout"
                         mask="0x30000"
                         values="SERCOM_SPIM_CTRLA__DOPO"/>
               <bitfield name="DIPO"
                         caption="Data In Pinout"
                         mask="0x300000"
                         values="SERCOM_SPIM_CTRLA__DIPO"/>
               <bitfield name="FORM"
                         caption="Frame Format"
                         mask="0xF000000"
                         values="SERCOM_SPIM_CTRLA__FORM"/>
               <bitfield name="CPHA"
                         caption="Clock Phase"
                         mask="0x10000000"
                         values="SERCOM_SPIM_CTRLA__CPHA"/>
               <bitfield name="CPOL"
                         caption="Clock Polarity"
                         mask="0x20000000"
                         values="SERCOM_SPIM_CTRLA__CPOL"/>
               <bitfield name="DORD"
                         caption="Data Order"
                         mask="0x40000000"
                         values="SERCOM_SPIM_CTRLA__DORD"/>
            </register>
            <register modes="SPIS"
                      name="CTRLA"
                      offset="0x0"
                      rw="RW"
                      size="4"
                      initval="0x00000000"
                      caption="SPIS Control A">
               <bitfield name="SWRST" caption="Software Reset" mask="0x1"/>
               <bitfield name="ENABLE" caption="Enable" mask="0x2"/>
               <bitfield name="MODE"
                         caption="Operating Mode"
                         mask="0x1C"
                         values="SERCOM_SPIM_CTRLA__MODE"/>
               <bitfield name="RUNSTDBY" caption="Run during Standby" mask="0x80"/>
               <bitfield name="IBON"
                         caption="Immediate Buffer Overflow Notification"
                         mask="0x100"/>
               <bitfield name="DOPO"
                         caption="Data Out Pinout"
                         mask="0x30000"
                         values="SERCOM_SPIM_CTRLA__DOPO"/>
               <bitfield name="DIPO"
                         caption="Data In Pinout"
                         mask="0x300000"
                         values="SERCOM_SPIM_CTRLA__DIPO"/>
               <bitfield name="FORM"
                         caption="Frame Format"
                         mask="0xF000000"
                         values="SERCOM_SPIM_CTRLA__FORM"/>
               <bitfield name="CPHA"
                         caption="Clock Phase"
                         mask="0x10000000"
                         values="SERCOM_SPIM_CTRLA__CPHA"/>
               <bitfield name="CPOL"
                         caption="Clock Polarity"
                         mask="0x20000000"
                         values="SERCOM_SPIM_CTRLA__CPOL"/>
               <bitfield name="DORD"
                         caption="Data Order"
                         mask="0x40000000"
                         values="SERCOM_SPIM_CTRLA__DORD"/>
            </register>
            <register modes="USART_EXT"
                      name="CTRLA"
                      offset="0x0"
                      rw="RW"
                      size="4"
                      initval="0x00000000"
                      caption="USART_EXT Control A">
               <bitfield name="SWRST" caption="Software Reset" mask="0x1"/>
               <bitfield name="ENABLE" caption="Enable" mask="0x2"/>
               <bitfield name="MODE"
                         caption="Operating Mode"
                         mask="0x1C"
                         values="SERCOM_USART_CTRLA__MODE"/>
               <bitfield name="RUNSTDBY" caption="Run during Standby" mask="0x80"/>
               <bitfield name="IBON"
                         caption="Immediate Buffer Overflow Notification"
                         mask="0x100"/>
               <bitfield name="SAMPR"
                         caption="Sample"
                         mask="0xE000"
                         values="SERCOM_USART_CTRLA__SAMPR"/>
               <bitfield name="TXPO"
                         caption="Transmit Data Pinout"
                         mask="0x30000"
                         values="SERCOM_USART_CTRLA__TXPO"/>
               <bitfield name="RXPO"
                         caption="Receive Data Pinout"
                         mask="0x300000"
                         values="SERCOM_USART_CTRLA__RXPO"/>
               <bitfield name="SAMPA"
                         caption="Sample Adjustment"
                         mask="0xC00000"
                         values="SERCOM_USART_CTRLA__SAMPA"/>
               <bitfield name="FORM"
                         caption="Frame Format"
                         mask="0xF000000"
                         values="SERCOM_USART_CTRLA__FORM"/>
               <bitfield name="CMODE"
                         caption="Communication Mode"
                         mask="0x10000000"
                         values="SERCOM_USART_CTRLA__CMODE"/>
               <bitfield name="CPOL"
                         caption="Clock Polarity"
                         mask="0x20000000"
                         values="SERCOM_USART_CTRLA__CPOL"/>
               <bitfield name="DORD"
                         caption="Data Order"
                         mask="0x40000000"
                         values="SERCOM_USART_CTRLA__DORD"/>
            </register>
            <register modes="USART_INT"
                      name="CTRLA"
                      offset="0x0"
                      rw="RW"
                      size="4"
                      initval="0x00000000"
                      caption="USART_INT Control A">
               <bitfield name="SWRST" caption="Software Reset" mask="0x1"/>
               <bitfield name="ENABLE" caption="Enable" mask="0x2"/>
               <bitfield name="MODE"
                         caption="Operating Mode"
                         mask="0x1C"
                         values="SERCOM_USART_CTRLA__MODE"/>
               <bitfield name="RUNSTDBY" caption="Run during Standby" mask="0x80"/>
               <bitfield name="IBON"
                         caption="Immediate Buffer Overflow Notification"
                         mask="0x100"/>
               <bitfield name="SAMPR"
                         caption="Sample"
                         mask="0xE000"
                         values="SERCOM_USART_CTRLA__SAMPR"/>
               <bitfield name="TXPO"
                         caption="Transmit Data Pinout"
                         mask="0x30000"
                         values="SERCOM_USART_CTRLA__TXPO"/>
               <bitfield name="RXPO"
                         caption="Receive Data Pinout"
                         mask="0x300000"
                         values="SERCOM_USART_CTRLA__RXPO"/>
               <bitfield name="SAMPA"
                         caption="Sample Adjustment"
                         mask="0xC00000"
                         values="SERCOM_USART_CTRLA__SAMPA"/>
               <bitfield name="FORM"
                         caption="Frame Format"
                         mask="0xF000000"
                         values="SERCOM_USART_CTRLA__FORM"/>
               <bitfield name="CMODE"
                         caption="Communication Mode"
                         mask="0x10000000"
                         values="SERCOM_USART_CTRLA__CMODE"/>
               <bitfield name="CPOL"
                         caption="Clock Polarity"
                         mask="0x20000000"
                         values="SERCOM_USART_CTRLA__CPOL"/>
               <bitfield name="DORD"
                         caption="Data Order"
                         mask="0x40000000"
                         values="SERCOM_USART_CTRLA__DORD"/>
            </register>
