Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMHA0_DFP/2.1.52/samha0ab/atdf/ATSAMHA0G17AB.atdf
            <register modes="I2CM"
                      name="STATUS"
                      offset="0x1A"
                      rw="RW"
                      size="2"
                      initval="0x0000"
                      caption="I2CM Status">
               <bitfield name="BUSERR" caption="Bus Error" mask="0x1"/>
               <bitfield name="ARBLOST" caption="Arbitration Lost" mask="0x2"/>
               <bitfield name="RXNACK" caption="Received Not Acknowledge" mask="0x4"/>
               <bitfield name="BUSSTATE" caption="Bus State" mask="0x30"/>
               <bitfield name="LOWTOUT" caption="SCL Low Timeout" mask="0x40"/>
               <bitfield name="CLKHOLD" caption="Clock Hold" mask="0x80"/>
               <bitfield name="MEXTTOUT"
                         caption="Master SCL Low Extend Timeout"
                         mask="0x100"/>
               <bitfield name="SEXTTOUT" caption="Slave SCL Low Extend Timeout" mask="0x200"/>
               <bitfield name="LENERR" caption="Length Error" mask="0x400"/>
            </register>
            <register modes="I2CS"
                      name="STATUS"
                      offset="0x1A"
                      rw="RW"
                      size="2"
                      initval="0x0000"
                      caption="I2CS Status">
               <bitfield name="BUSERR" caption="Bus Error" mask="0x1"/>
               <bitfield name="COLL" caption="Transmit Collision" mask="0x2"/>
               <bitfield name="RXNACK" caption="Received Not Acknowledge" mask="0x4"/>
               <bitfield name="DIR" caption="Read/Write Direction" mask="0x8"/>
               <bitfield name="SR" caption="Repeated Start" mask="0x10"/>
               <bitfield name="LOWTOUT" caption="SCL Low Timeout" mask="0x40"/>
               <bitfield name="CLKHOLD" caption="Clock Hold" mask="0x80"/>
               <bitfield name="SEXTTOUT" caption="Slave SCL Low Extend Timeout" mask="0x200"/>
               <bitfield name="HS" caption="High Speed" mask="0x400"/>
            </register>
            <register modes="SPIM"
                      name="STATUS"
                      offset="0x1A"
                      rw="RW"
                      size="2"
                      initval="0x0000"
                      caption="SPIM Status">
               <bitfield name="BUFOVF" caption="Buffer Overflow" mask="0x4"/>
            </register>
            <register modes="SPIS"
                      name="STATUS"
                      offset="0x1A"
                      rw="RW"
                      size="2"
                      initval="0x0000"
                      caption="SPIS Status">
               <bitfield name="BUFOVF" caption="Buffer Overflow" mask="0x4"/>
            </register>
            <register modes="USART_EXT"
                      name="STATUS"
                      offset="0x1A"
                      rw="RW"
                      size="2"
                      initval="0x0000"
                      caption="USART_EXT Status">
               <bitfield name="PERR" caption="Parity Error" mask="0x1"/>
               <bitfield name="FERR" caption="Frame Error" mask="0x2"/>
               <bitfield name="BUFOVF" caption="Buffer Overflow" mask="0x4"/>
               <bitfield name="CTS" caption="Clear To Send" mask="0x8"/>
               <bitfield name="ISF" caption="Inconsistent Sync Field" mask="0x10"/>
               <bitfield name="COLL" caption="Collision Detected" mask="0x20"/>
               <bitfield name="TXE" caption="Transmitter Empty" mask="0x40"/>
            </register>
            <register modes="USART_INT"
                      name="STATUS"
                      offset="0x1A"
                      rw="RW"
                      size="2"
                      initval="0x0000"
                      caption="USART_INT Status">
               <bitfield name="PERR" caption="Parity Error" mask="0x1"/>
               <bitfield name="FERR" caption="Frame Error" mask="0x2"/>
               <bitfield name="BUFOVF" caption="Buffer Overflow" mask="0x4"/>
               <bitfield name="CTS" caption="Clear To Send" mask="0x8"/>
               <bitfield name="ISF" caption="Inconsistent Sync Field" mask="0x10"/>
               <bitfield name="COLL" caption="Collision Detected" mask="0x20"/>
               <bitfield name="TXE" caption="Transmitter Empty" mask="0x40"/>
            </register>
            <register modes="I2CM"
                      name="SYNCBUSY"
                      offset="0x1C"
                      rw="R"
                      size="4"
                      initval="0x00000000"
                      caption="I2CM Synchronization Busy">
               <bitfield name="SWRST"
                         caption="Software Reset Synchronization Busy"
                         mask="0x1"/>
               <bitfield name="ENABLE"
                         caption="SERCOM Enable Synchronization Busy"
                         mask="0x2"/>
               <bitfield name="SYSOP"
                         caption="System Operation Synchronization Busy"
                         mask="0x4"/>
            </register>
            <register modes="I2CS"
                      name="SYNCBUSY"
                      offset="0x1C"
                      rw="R"
                      size="4"
                      initval="0x00000000"
                      caption="I2CS Synchronization Busy">
               <bitfield name="SWRST"
                         caption="Software Reset Synchronization Busy"
                         mask="0x1"/>
               <bitfield name="ENABLE"
                         caption="SERCOM Enable Synchronization Busy"
                         mask="0x2"/>
            </register>
            <register modes="SPIM"
                      name="SYNCBUSY"
                      offset="0x1C"
                      rw="R"
                      size="4"
                      initval="0x00000000"
                      caption="SPIM Synchronization Busy">
               <bitfield name="SWRST"
                         caption="Software Reset Synchronization Busy"
                         mask="0x1"/>
               <bitfield name="ENABLE"
                         caption="SERCOM Enable Synchronization Busy"
                         mask="0x2"/>
               <bitfield name="CTRLB" caption="CTRLB Synchronization Busy" mask="0x4"/>
            </register>
            <register modes="SPIS"
                      name="SYNCBUSY"
                      offset="0x1C"
                      rw="R"
                      size="4"
                      initval="0x00000000"
                      caption="SPIS Synchronization Busy">
               <bitfield name="SWRST"
                         caption="Software Reset Synchronization Busy"
                         mask="0x1"/>
               <bitfield name="ENABLE"
                         caption="SERCOM Enable Synchronization Busy"
                         mask="0x2"/>
               <bitfield name="CTRLB" caption="CTRLB Synchronization Busy" mask="0x4"/>
            </register>
            <register modes="USART_EXT"
                      name="SYNCBUSY"
                      offset="0x1C"
                      rw="R"
                      size="4"
                      initval="0x00000000"
                      caption="USART_EXT Synchronization Busy">
               <bitfield name="SWRST"
                         caption="Software Reset Synchronization Busy"
                         mask="0x1"/>
               <bitfield name="ENABLE"
                         caption="SERCOM Enable Synchronization Busy"
                         mask="0x2"/>
               <bitfield name="CTRLB" caption="CTRLB Synchronization Busy" mask="0x4"/>
            </register>
            <register modes="USART_INT"
                      name="SYNCBUSY"
                      offset="0x1C"
                      rw="R"
                      size="4"
                      initval="0x00000000"
                      caption="USART_INT Synchronization Busy">
               <bitfield name="SWRST"
                         caption="Software Reset Synchronization Busy"
                         mask="0x1"/>
               <bitfield name="ENABLE"
                         caption="SERCOM Enable Synchronization Busy"
                         mask="0x2"/>
               <bitfield name="CTRLB" caption="CTRLB Synchronization Busy" mask="0x4"/>
            </register>
