Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMHA0_DFP/2.1.52/samha0ab/atdf/ATSAMHA0G17AB.atdf
            <register name="CTRLBSET"
                      offset="0x5"
                      rw="RW"
                      size="1"
                      atomic-op="set:CTRLBSET"
                      initval="0x00"
                      caption="Control B Set">
               <bitfield name="DIR" caption="Counter Direction" mask="0x1"/>
               <bitfield name="ONESHOT" caption="One-Shot" mask="0x4"/>
               <bitfield name="CMD"
                         caption="Command"
                         mask="0xC0"
                         values="TC_CTRLBSET__CMD"/>
            </register>
            <register name="CTRLC"
                      offset="0x6"
                      rw="RW"
                      size="1"
                      initval="0x00"
                      caption="Control C">
               <bitfield name="INVEN0" caption="Output Waveform 0 Invert Enable" mask="0x1"/>
               <bitfield name="INVEN1" caption="Output Waveform 1 Invert Enable" mask="0x2"/>
               <bitfield name="CPTEN0" caption="Capture Channel 0 Enable" mask="0x10"/>
               <bitfield name="CPTEN1" caption="Capture Channel 1 Enable" mask="0x20"/>
            </register>
            <register name="DBGCTRL"
                      offset="0x8"
                      rw="RW"
                      size="1"
                      initval="0x00"
                      caption="Debug Control">
               <bitfield name="DBGRUN" caption="Debug Run Mode" mask="0x1"/>
            </register>
            <register name="EVCTRL"
                      offset="0xA"
                      rw="RW"
                      size="2"
                      initval="0x0000"
                      caption="Event Control">
               <bitfield name="EVACT"
                         caption="Event Action"
                         mask="0x7"
                         values="TC_EVCTRL__EVACT"/>
               <bitfield name="TCINV" caption="TC Inverted Event Input" mask="0x10"/>
               <bitfield name="TCEI" caption="TC Event Input" mask="0x20"/>
               <bitfield name="OVFEO"
                         caption="Overflow/Underflow Event Output Enable"
                         mask="0x100"/>
               <bitfield name="MCEO0"
                         caption="Match or Capture Channel 0 Event Output Enable"
                         mask="0x1000"/>
               <bitfield name="MCEO1"
                         caption="Match or Capture Channel 1 Event Output Enable"
                         mask="0x2000"/>
            </register>
            <register name="INTENCLR"
                      offset="0xC"
                      rw="RW"
                      size="1"
                      atomic-op="clear:INTENCLR"
                      initval="0x00"
                      caption="Interrupt Enable Clear">
               <bitfield name="OVF" caption="Overflow Interrupt Enable" mask="0x1"/>
               <bitfield name="ERR" caption="Error Interrupt Enable" mask="0x2"/>
               <bitfield name="SYNCRDY"
                         caption="Synchronization Ready Interrupt Enable"
                         mask="0x8"/>
               <bitfield name="MC0"
                         caption="Match or Capture Channel 0 Interrupt Enable"
                         mask="0x10"/>
               <bitfield name="MC1"
                         caption="Match or Capture Channel 1 Interrupt Enable"
                         mask="0x20"/>
            </register>
            <register name="INTENSET"
                      offset="0xD"
                      rw="RW"
                      size="1"
                      atomic-op="set:INTENSET"
                      initval="0x00"
                      caption="Interrupt Enable Set">
               <bitfield name="OVF" caption="Overflow Interrupt Enable" mask="0x1"/>
               <bitfield name="ERR" caption="Error Interrupt Enable" mask="0x2"/>
               <bitfield name="SYNCRDY"
                         caption="Synchronization Ready Interrupt Enable"
                         mask="0x8"/>
               <bitfield name="MC0"
                         caption="Match or Capture Channel 0 Interrupt Enable"
                         mask="0x10"/>
               <bitfield name="MC1"
                         caption="Match or Capture Channel 1 Interrupt Enable"
                         mask="0x20"/>
            </register>
            <register name="INTFLAG"
                      offset="0xE"
                      rw="RW"
                      size="1"
                      atomic-op="clear:INTFLAG"
                      initval="0x00"
                      caption="Interrupt Flag Status and Clear">
               <bitfield name="OVF" caption="Overflow" mask="0x1"/>
               <bitfield name="ERR" caption="Error" mask="0x2"/>
               <bitfield name="SYNCRDY" caption="Synchronization Ready" mask="0x8"/>
               <bitfield name="MC0" caption="Match or Capture Channel 0" mask="0x10"/>
               <bitfield name="MC1" caption="Match or Capture Channel 1" mask="0x20"/>
            </register>
            <register name="STATUS"
                      offset="0xF"
                      rw="R"
                      size="1"
                      initval="0x08"
                      caption="Status">
               <bitfield name="STOP" caption="Stop" mask="0x8"/>
               <bitfield name="SLAVE" caption="Slave" mask="0x10"/>
               <bitfield name="SYNCBUSY" caption="Synchronization Busy" mask="0x80"/>
            </register>
            <register modes="COUNT8"
                      name="COUNT"
                      offset="0x10"
                      rw="RW"
                      size="1"
                      initval="0x00"
                      caption="COUNT8 Counter Value">
               <bitfield name="COUNT" caption="Counter Value" mask="0xFF"/>
            </register>
            <register modes="COUNT16"
                      name="COUNT"
                      offset="0x10"
                      rw="RW"
                      size="2"
                      initval="0x0000"
                      caption="COUNT16 Counter Value">
               <bitfield name="COUNT" caption="Count Value" mask="0xFFFF"/>
            </register>
            <register modes="COUNT32"
                      name="COUNT"
                      offset="0x10"
                      rw="RW"
                      size="4"
                      initval="0x00000000"
                      caption="COUNT32 Counter Value">
               <bitfield name="COUNT" caption="Count Value" mask="0xFFFFFFFF"/>
            </register>
            <register modes="COUNT8"
                      name="PER"
                      offset="0x14"
                      rw="RW"
                      size="1"
                      initval="0xFF"
                      caption="COUNT8 Period Value">
               <bitfield name="PER" caption="Period Value" mask="0xFF"/>
            </register>
            <register modes="COUNT8"
                      name="CC"
                      offset="0x18"
                      rw="RW"
                      size="1"
                      count="2"
                      initval="0x00"
                      caption="COUNT8 Compare/Capture">
               <bitfield name="CC" caption="Compare/Capture Value" mask="0xFF"/>
            </register>
