Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMHA0_DFP/2.1.52/samha0ab/atdf/ATSAMHA0G17AB.atdf
            <register name="CTRLBSET"
                      offset="0x5"
                      rw="RW"
                      access="RWSYNC"
                      size="1"
                      atomic-op="set:CTRLBSET"
                      initval="0x00"
                      caption="Control B Set">
               <bitfield name="DIR" caption="Counter Direction" mask="0x1"/>
               <bitfield name="LUPD" caption="Lock Update" mask="0x2"/>
               <bitfield name="ONESHOT" caption="One-Shot" mask="0x4"/>
               <bitfield name="IDXCMD"
                         caption="Ramp Index Command"
                         mask="0x18"
                         values="TCC_CTRLBSET__IDXCMD"/>
               <bitfield name="CMD"
                         caption="TCC Command"
                         mask="0xE0"
                         values="TCC_CTRLBSET__CMD"/>
            </register>
            <register name="SYNCBUSY"
                      offset="0x8"
                      rw="R"
                      size="4"
                      initval="0x00000000"
                      caption="Synchronization Busy">
               <bitfield name="SWRST" caption="Swrst Busy" mask="0x1"/>
               <bitfield name="ENABLE" caption="Enable Busy" mask="0x2"/>
               <bitfield name="CTRLB" caption="Ctrlb Busy" mask="0x4"/>
               <bitfield name="STATUS" caption="Status Busy" mask="0x8"/>
               <bitfield name="COUNT" caption="Count Busy" mask="0x10"/>
               <bitfield name="PATT" caption="Pattern Busy" mask="0x20"/>
               <bitfield name="WAVE" caption="Wave Busy" mask="0x40"/>
               <bitfield name="PER" caption="Period busy" mask="0x80"/>
               <bitfield name="CC0" caption="Compare Channel 0 Busy" mask="0x100"/>
               <bitfield name="CC1" caption="Compare Channel 1 Busy" mask="0x200"/>
               <bitfield name="CC2" caption="Compare Channel 2 Busy" mask="0x400"/>
               <bitfield name="CC3" caption="Compare Channel 3 Busy" mask="0x800"/>
               <bitfield name="PATTB" caption="Pattern Buffer Busy" mask="0x10000"/>
               <bitfield name="WAVEB" caption="Wave Buffer Busy" mask="0x20000"/>
               <bitfield name="PERB" caption="Period Buffer Busy" mask="0x40000"/>
               <bitfield name="CCB0" caption="Compare Channel Buffer 0 Busy" mask="0x80000"/>
               <bitfield name="CCB1" caption="Compare Channel Buffer 1 Busy" mask="0x100000"/>
               <bitfield name="CCB2" caption="Compare Channel Buffer 2 Busy" mask="0x200000"/>
               <bitfield name="CCB3" caption="Compare Channel Buffer 3 Busy" mask="0x400000"/>
            </register>
            <register name="FCTRLA"
                      offset="0xC"
                      rw="RW"
                      size="4"
                      initval="0x00000000"
                      caption="Recoverable Fault A Configuration">
               <bitfield name="SRC"
                         caption="Fault A Source"
                         mask="0x3"
                         values="TCC_FCTRLA__SRC"/>
               <bitfield name="KEEP" caption="Fault A Keeper" mask="0x8"/>
               <bitfield name="QUAL" caption="Fault A Qualification" mask="0x10"/>
               <bitfield name="BLANK"
                         caption="Fault A Blanking Mode"
                         mask="0x60"
                         values="TCC_FCTRLA__BLANK"/>
               <bitfield name="RESTART" caption="Fault A Restart" mask="0x80"/>
               <bitfield name="HALT"
                         caption="Fault A Halt Mode"
                         mask="0x300"
                         values="TCC_FCTRLA__HALT"/>
               <bitfield name="CHSEL"
                         caption="Fault A Capture Channel"
                         mask="0xC00"
                         values="TCC_FCTRLA__CHSEL"/>
               <bitfield name="CAPTURE"
                         caption="Fault A Capture Action"
                         mask="0x7000"
                         values="TCC_FCTRLA__CAPTURE"/>
               <bitfield name="BLANKVAL" caption="Fault A Blanking Time" mask="0xFF0000"/>
               <bitfield name="FILTERVAL" caption="Fault A Filter Value" mask="0xF000000"/>
            </register>
            <register name="FCTRLB"
                      offset="0x10"
                      rw="RW"
                      size="4"
                      initval="0x00000000"
                      caption="Recoverable Fault B Configuration">
               <bitfield name="SRC"
                         caption="Fault B Source"
                         mask="0x3"
                         values="TCC_FCTRLB__SRC"/>
               <bitfield name="KEEP" caption="Fault B Keeper" mask="0x8"/>
               <bitfield name="QUAL" caption="Fault B Qualification" mask="0x10"/>
               <bitfield name="BLANK"
                         caption="Fault B Blanking Mode"
                         mask="0x60"
                         values="TCC_FCTRLB__BLANK"/>
               <bitfield name="RESTART" caption="Fault B Restart" mask="0x80"/>
               <bitfield name="HALT"
                         caption="Fault B Halt Mode"
                         mask="0x300"
                         values="TCC_FCTRLB__HALT"/>
               <bitfield name="CHSEL"
                         caption="Fault B Capture Channel"
                         mask="0xC00"
                         values="TCC_FCTRLB__CHSEL"/>
               <bitfield name="CAPTURE"
                         caption="Fault B Capture Action"
                         mask="0x7000"
                         values="TCC_FCTRLB__CAPTURE"/>
               <bitfield name="BLANKVAL" caption="Fault B Blanking Time" mask="0xFF0000"/>
               <bitfield name="FILTERVAL" caption="Fault B Filter Value" mask="0xF000000"/>
            </register>
            <register name="WEXCTRL"
                      offset="0x14"
                      rw="RW"
                      size="4"
                      initval="0x00000000"
                      caption="Waveform Extension Configuration">
               <bitfield name="OTMX" caption="Output Matrix" mask="0x3"/>
               <bitfield name="DTIEN0"
                         caption="Dead-time Insertion Generator 0 Enable"
                         mask="0x100"/>
               <bitfield name="DTIEN1"
                         caption="Dead-time Insertion Generator 1 Enable"
                         mask="0x200"/>
               <bitfield name="DTIEN2"
                         caption="Dead-time Insertion Generator 2 Enable"
                         mask="0x400"/>
               <bitfield name="DTIEN3"
                         caption="Dead-time Insertion Generator 3 Enable"
                         mask="0x800"/>
               <bitfield name="DTLS"
                         caption="Dead-time Low Side Outputs Value"
                         mask="0xFF0000"/>
               <bitfield name="DTHS"
                         caption="Dead-time High Side Outputs Value"
                         mask="0xFF000000"/>
            </register>
            <register name="DRVCTRL"
                      offset="0x18"
                      rw="RW"
                      size="4"
                      initval="0x00000000"
                      caption="Driver Control">
               <bitfield name="NRE0"
                         caption="Non-Recoverable State 0 Output Enable"
                         mask="0x1"/>
               <bitfield name="NRE1"
                         caption="Non-Recoverable State 1 Output Enable"
                         mask="0x2"/>
               <bitfield name="NRE2"
                         caption="Non-Recoverable State 2 Output Enable"
                         mask="0x4"/>
               <bitfield name="NRE3"
                         caption="Non-Recoverable State 3 Output Enable"
                         mask="0x8"/>
               <bitfield name="NRE4"
                         caption="Non-Recoverable State 4 Output Enable"
                         mask="0x10"/>
               <bitfield name="NRE5"
                         caption="Non-Recoverable State 5 Output Enable"
                         mask="0x20"/>
               <bitfield name="NRE6"
                         caption="Non-Recoverable State 6 Output Enable"
                         mask="0x40"/>
               <bitfield name="NRE7"
                         caption="Non-Recoverable State 7 Output Enable"
                         mask="0x80"/>
               <bitfield name="NRV0"
                         caption="Non-Recoverable State 0 Output Value"
                         mask="0x100"/>
               <bitfield name="NRV1"
                         caption="Non-Recoverable State 1 Output Value"
                         mask="0x200"/>
               <bitfield name="NRV2"
                         caption="Non-Recoverable State 2 Output Value"
                         mask="0x400"/>
               <bitfield name="NRV3"
                         caption="Non-Recoverable State 3 Output Value"
                         mask="0x800"/>
               <bitfield name="NRV4"
                         caption="Non-Recoverable State 4 Output Value"
                         mask="0x1000"/>
               <bitfield name="NRV5"
                         caption="Non-Recoverable State 5 Output Value"
                         mask="0x2000"/>
               <bitfield name="NRV6"
                         caption="Non-Recoverable State 6 Output Value"
                         mask="0x4000"/>
               <bitfield name="NRV7"
                         caption="Non-Recoverable State 7 Output Value"
                         mask="0x8000"/>
               <bitfield name="INVEN0" caption="Output Waveform 0 Inversion" mask="0x10000"/>
               <bitfield name="INVEN1" caption="Output Waveform 1 Inversion" mask="0x20000"/>
               <bitfield name="INVEN2" caption="Output Waveform 2 Inversion" mask="0x40000"/>
               <bitfield name="INVEN3" caption="Output Waveform 3 Inversion" mask="0x80000"/>
               <bitfield name="INVEN4" caption="Output Waveform 4 Inversion" mask="0x100000"/>
               <bitfield name="INVEN5" caption="Output Waveform 5 Inversion" mask="0x200000"/>
               <bitfield name="INVEN6" caption="Output Waveform 6 Inversion" mask="0x400000"/>
               <bitfield name="INVEN7" caption="Output Waveform 7 Inversion" mask="0x800000"/>
               <bitfield name="FILTERVAL0"
                         caption="Non-Recoverable Fault Input 0 Filter Value"
                         mask="0xF000000"/>
               <bitfield name="FILTERVAL1"
                         caption="Non-Recoverable Fault Input 1 Filter Value"
                         mask="0xF0000000"/>
            </register>
            <register name="DBGCTRL"
                      offset="0x1E"
                      rw="RW"
                      size="1"
                      initval="0x00"
                      caption="Debug Control">
               <bitfield name="DBGRUN" caption="Debug Running Mode" mask="0x1"/>
               <bitfield name="FDDBD"
                         caption="Fault Detection on Debug Break Detection"
                         mask="0x4"/>
            </register>
            <register name="EVCTRL"
                      offset="0x20"
                      rw="RW"
                      size="4"
                      initval="0x00000000"
                      caption="Event Control">
               <bitfield name="EVACT0"
                         caption="Timer/counter Input Event0 Action"
                         mask="0x7"
                         values="TCC_EVCTRL__EVACT0"/>
               <bitfield name="EVACT1"
                         caption="Timer/counter Input Event1 Action"
                         mask="0x38"
                         values="TCC_EVCTRL__EVACT1"/>
               <bitfield name="CNTSEL"
                         caption="Timer/counter Output Event Mode"
                         mask="0xC0"
                         values="TCC_EVCTRL__CNTSEL"/>
               <bitfield name="OVFEO"
                         caption="Overflow/Underflow Output Event Enable"
                         mask="0x100"/>
               <bitfield name="TRGEO" caption="Retrigger Output Event Enable" mask="0x200"/>
               <bitfield name="CNTEO"
                         caption="Timer/counter Output Event Enable"
                         mask="0x400"/>
               <bitfield name="TCINV0" caption="Inverted Event 0 Input Enable" mask="0x1000"/>
               <bitfield name="TCINV1" caption="Inverted Event 1 Input Enable" mask="0x2000"/>
               <bitfield name="TCEI0"
                         caption="Timer/counter Event 0 Input Enable"
                         mask="0x4000"/>
               <bitfield name="TCEI1"
                         caption="Timer/counter Event 1 Input Enable"
                         mask="0x8000"/>
               <bitfield name="MCEI0"
                         caption="Match or Capture Channel 0 Event Input Enable"
                         mask="0x10000"/>
               <bitfield name="MCEI1"
                         caption="Match or Capture Channel 1 Event Input Enable"
                         mask="0x20000"/>
               <bitfield name="MCEI2"
                         caption="Match or Capture Channel 2 Event Input Enable"
                         mask="0x40000"/>
               <bitfield name="MCEI3"
                         caption="Match or Capture Channel 3 Event Input Enable"
                         mask="0x80000"/>
               <bitfield name="MCEO0"
                         caption="Match or Capture Channel 0 Event Output Enable"
                         mask="0x1000000"/>
               <bitfield name="MCEO1"
                         caption="Match or Capture Channel 1 Event Output Enable"
                         mask="0x2000000"/>
               <bitfield name="MCEO2"
                         caption="Match or Capture Channel 2 Event Output Enable"
                         mask="0x4000000"/>
               <bitfield name="MCEO3"
                         caption="Match or Capture Channel 3 Event Output Enable"
                         mask="0x8000000"/>
            </register>
