Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMHA0_DFP/2.1.52/samha0ab/atdf/ATSAMHA0G17AB.atdf
         <value-group name="TCC_WAVEB__WAVEGENB">
            <value name="NFRQ" caption="Normal frequency" value="0"/>
            <value name="MFRQ" caption="Match frequency" value="1"/>
            <value name="NPWM" caption="Normal PWM" value="2"/>
            <value name="DSCRITICAL" caption="Dual-slope critical" value="4"/>
            <value name="DSBOTTOM"
                   caption="Dual-slope with interrupt/event condition when COUNT reaches ZERO"
                   value="5"/>
            <value name="DSBOTH"
                   caption="Dual-slope with interrupt/event condition when COUNT reaches ZERO or TOP"
                   value="6"/>
            <value name="DSTOP"
                   caption="Dual-slope with interrupt/event condition when COUNT reaches TOP"
                   value="7"/>
         </value-group>
      </module>
      <module name="WDT" id="U2203" version="2.0.0" caption="Watchdog Timer">
         <register-group name="WDT" caption="Watchdog Timer">
            <register name="CTRL"
                      offset="0x0"
                      rw="RW"
                      access="WSYNC"
                      size="1"
                      initval="0x00"
                      caption="Control">
               <bitfield name="ENABLE" caption="Enable" mask="0x2"/>
               <bitfield name="WEN" caption="Watchdog Timer Window Mode Enable" mask="0x4"/>
               <bitfield name="ALWAYSON" caption="Always-On" mask="0x80"/>
            </register>
            <register name="CONFIG"
                      offset="0x1"
                      rw="RW"
                      access="WSYNC"
                      size="1"
                      initval="0xBB"
                      caption="Configuration">
               <bitfield name="PER"
                         caption="Time-Out Period"
                         mask="0xF"
                         values="WDT_CONFIG__PER"/>
               <bitfield name="WINDOW"
                         caption="Window Mode Time-Out Period"
                         mask="0xF0"
                         values="WDT_CONFIG__WINDOW"/>
            </register>
            <register name="EWCTRL"
                      offset="0x2"
                      rw="RW"
                      size="1"
                      initval="0x0B"
                      caption="Early Warning Interrupt Control">
               <bitfield name="EWOFFSET"
                         caption="Early Warning Interrupt Time Offset"
                         mask="0xF"
                         values="WDT_EWCTRL__EWOFFSET"/>
            </register>
            <register name="INTENCLR"
                      offset="0x4"
                      rw="RW"
                      size="1"
                      atomic-op="clear:INTENCLR"
                      initval="0x00"
                      caption="Interrupt Enable Clear">
               <bitfield name="EW" caption="Early Warning Interrupt Enable" mask="0x1"/>
            </register>
            <register name="INTENSET"
                      offset="0x5"
                      rw="RW"
                      size="1"
                      atomic-op="set:INTENSET"
                      initval="0x00"
                      caption="Interrupt Enable Set">
               <bitfield name="EW" caption="Early Warning Interrupt Enable" mask="0x1"/>
            </register>
            <register name="INTFLAG"
                      offset="0x6"
                      rw="RW"
                      size="1"
                      atomic-op="clear:INTFLAG"
                      initval="0x00"
                      caption="Interrupt Flag Status and Clear">
               <bitfield name="EW" caption="Early Warning" mask="0x1"/>
            </register>
            <register name="STATUS"
                      offset="0x7"
                      rw="R"
                      size="1"
                      initval="0x00"
                      caption="Status">
               <bitfield name="SYNCBUSY" caption="Synchronization Busy" mask="0x80"/>
            </register>
            <register name="CLEAR"
                      offset="0x8"
                      rw="W"
                      access="WSYNC"
                      size="1"
                      initval="0x00"
                      caption="Clear">
               <bitfield name="CLEAR"
                         caption="Watchdog Clear"
                         mask="0xFF"
                         values="WDT_CLEAR__CLEAR"/>
            </register>
         </register-group>
         <value-group name="WDT_CONFIG__PER">
            <value name="8" caption="8 clock cycles" value="0x0"/>
            <value name="16" caption="16 clock cycles" value="0x1"/>
            <value name="32" caption="32 clock cycles" value="0x2"/>
            <value name="64" caption="64 clock cycles" value="0x3"/>
            <value name="128" caption="128 clock cycles" value="0x4"/>
            <value name="256" caption="256 clock cycles" value="0x5"/>
            <value name="512" caption="512 clock cycles" value="0x6"/>
            <value name="1K" caption="1024 clock cycles" value="0x7"/>
            <value name="2K" caption="2048 clock cycles" value="0x8"/>
            <value name="4K" caption="4096 clock cycles" value="0x9"/>
            <value name="8K" caption="8192 clock cycles" value="0xA"/>
            <value name="16K" caption="16384 clock cycles" value="0xB"/>
         </value-group>
         <value-group name="WDT_CONFIG__WINDOW">
            <value name="8" caption="8 clock cycles" value="0x0"/>
            <value name="16" caption="16 clock cycles" value="0x1"/>
            <value name="32" caption="32 clock cycles" value="0x2"/>
            <value name="64" caption="64 clock cycles" value="0x3"/>
            <value name="128" caption="128 clock cycles" value="0x4"/>
            <value name="256" caption="256 clock cycles" value="0x5"/>
            <value name="512" caption="512 clock cycles" value="0x6"/>
            <value name="1K" caption="1024 clock cycles" value="0x7"/>
            <value name="2K" caption="2048 clock cycles" value="0x8"/>
            <value name="4K" caption="4096 clock cycles" value="0x9"/>
            <value name="8K" caption="8192 clock cycles" value="0xA"/>
            <value name="16K" caption="16384 clock cycles" value="0xB"/>
         </value-group>
